app/controllers/data_controller.rb

  def store_raw
    if !is_authenticated?
      render json: {message: "failed to authenticate"}, status: :unprocessable_entity
    else
      ecg = Ecg.new(ecg_params)
      ecg_raw = EcgRaw.new(ecg_raw_params)
      ecg_raw.ecg = ecg
      if !ecg.valid?
        render json: ecg.errors, status: :unprocessable_entity
      elsif !ecg_raw.valid?
        render json: ecg_raw.errors, status: :unprocessable_entity
      else
        ActiveRecord::Base.transaction do
          ecg.save!
---
INSERT INTO "ecg_raws" ("ecg_id", "classification", "symptoms", "device", "sample_rate", "unit", "values", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "ecgs" ("patient_id", "recorded_data", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["patient_id", 1], ["recorded_data", "2021-03-02 07:35:54"], ["created_at", "2021-03-06 10:51:38.936261"], ["updated_at", "2021-03-06 10:51:38.936261"]]

  def store_data
    @ecg = @patient.ecgs.find(@body["ecg_id"])
    if !is_authenticated?
      render json: {message: "failed to authenticate"}, status: :unprocessable_entity
    elsif @ecg.nil?
      render json: {message: "failed to find ecg"}, status: :unprocessable_entity
    else
      ecg_data = EcgData.new(ecg_data_params)
      ecg_data.ecg = @ecg
      if ecg_data.save
---
SELECT  "ecgs".* FROM "ecgs" WHERE "ecgs"."patient_id" = ? AND "ecgs"."id" = ? LIMIT ?  [["patient_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "ecg_data" ("hr", "hrv", "pnn50", "nn50", "lfhf", "anomaly", "ecg_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["hr", 1], ["hrv", 1], ["pnn50", 1], ["nn50", 1], ["lfhf", 1], ["anomaly", "f"], ["ecg_id", 1], ["created_at", "2021-03-07 20:36:23.166537"], ["updated_at", "2021-03-07 20:36:23.166537"]]

  def ecg_raw
    @ecgs = @patient.ecgs&.last(@body["limit"])
---
SELECT  "ecgs".* FROM "ecgs" WHERE "ecgs"."patient_id" = ? ORDER BY "ecgs"."id" DESC LIMIT ?  [["patient_id", 1], ["LIMIT", 1]]