app/controllers/patients_controller.rb

  def login
    @patient = Patient.find_by(email: @body["email"].downcase)
---
SELECT  "patients".* FROM "patients" WHERE "patients"."email" = ? LIMIT ?  [["email", "sara@example.com"], ["LIMIT", 1]]

  def create
    @patient = Patient.new(patient_params)
    if @patient.save
---
INSERT INTO "patients" ("email", "password_digest", "first_name", "last_name", "height", "weight", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    patient = get_patient(@body["token"])
    if patient != @patient
      render json: {message: "failed to authenticate"}, status: :unprocessable_entity
    elsif @patient.update(patient_params)
---
UPDATE "patients" SET "email" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["email", "myemail@email.com"], ["updated_at", "2021-02-26 10:45:13.838567"], ["id", 980190962]]

  def destroy
    patient = get_patient(@body["token"])
    if patient != @patient
      render json: {message: "failed to authenticate"}, status: :unprocessable_entity
    elsif @patient.destroy
---
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 980190962]]

  def associate
    patient = get_patient(@body["token"])
    therapist = Therapist.find_by(code: @body["code"])
    if patient != @patient || therapist.nil?
      render json: {message: "failed to authenticate"}, status: :unprocessable_entity
    else
      patient.therapist_id = therapist.id
      if patient.save
---
SELECT  "therapists".* FROM "therapists" WHERE "therapists"."code" = ? LIMIT ?  [["code", "foobar"], ["LIMIT", 1]]
UPDATE "patients" SET "therapist_id" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["therapist_id", 1], ["updated_at", "2021-03-07 19:45:43.770419"], ["id", 1]]

  def unassociate
    patient = get_patient(@body["token"])
    patient.therapist_id = nil
    if patient != @patient
      render json: {message: "failed to authenticate"}, status: :unprocessable_entity
    elsif patient.save
---
UPDATE "patients" SET "therapist_id" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["therapist_id", nil], ["updated_at", "2021-03-07 20:56:02.017278"], ["id", 1]]

  def ecg_data
    patient = get_patient(@body["token"])
    @ecgs = @patient.ecgs
    if patient != @patient
      render json: {message: "failed to authenticate"}, status: :unprocessable_entity
    elsif @ecgs.nil? || @ecgs.empty?
---
SELECT  1 AS one FROM "ecgs" WHERE "ecgs"."patient_id" = ? LIMIT ?  [["patient_id", 1], ["LIMIT", 1]]
SELECT "ecgs".* FROM "ecgs" WHERE "ecgs"."patient_id" = ?  [["patient_id", 1]]