app/controllers/therapists_controller.rb

  def index
    @therapists = Therapist.all
---
SELECT "therapists".* FROM "therapists"

  def patients
    therapist = get_therapist(@body["token"])
    if @therapist != therapist
      render json: {message: "failed to authenticate"}, status: :unprocessable_entity
    else
      patients = therapist.patients.map do |patient|
---
SELECT "patients".* FROM "patients" WHERE "patients"."therapist_id" = ?  [["therapist_id", 2]]

  def create
    @therapist = Therapist.new(therapist_params.merge({code: create_code}))
    if @therapist.save
      render :json => {
         id: @therapist.id,
         email: @therapist.email,
         firstName: @therapist.first_name,
         lastName: @therapist.last_name,
         prefix: @therapist.prefix,
         profession: @therapist.profession,
         code: @therapist.code,
         token: get_token(@therapist)
---
INSERT INTO "therapists" ("email", "password_digest", "first_name", "last_name", "prefix", "profession", "created_at", "updated_at", "code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "therapists".* FROM "therapists" ORDER BY "therapists"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]

  def destroy
    @therapist.destroy
---
DELETE FROM "therapists" WHERE "therapists"."id" = ?  [["id", 980190962]]

    def set_therapist
      @therapist = Therapist.find(params[:id])
---
SELECT  "therapists".* FROM "therapists" WHERE "therapists"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]